{
	"projects":
	{
		"Red_Orchestra_2":
		{
			"name": "Red Orchestra 2",
			"platform": "PC Game",
			"image": "images/RO2.jpg",
			"mobileImage": "images/RO2_M.jpg",
			"wideImage": "images/RO2_W.jpg",
			"buttonImage": "images/RO2_B.jpg",
			"tools":
			[
				"Unreal Engine 3",
				"UnrealScript",
				"Scaleform",
				"AS2"
			],
			"links":
			[
				{
					"name": "Website",
					"url": "http://www.heroesofstalingrad.com/",
					"icon": "images/website.svg"
				},
				{
					"name": "Steam Page",
					"url": "https://store.steampowered.com/app/35450/",
					"icon": "images/play.svg"
				}
			],
			"video": "https://www.youtube.com/embed/OIk6pl6WWB8",
			"images":
			[
				{
					"thumbnail": "images/RO2_1_s.jpg",
					"url": "images/RO2_1.jpg"
				},
				{
					"thumbnail": "images/RO2_2_s.jpg",
					"url": "images/RO2_2.jpg"
				}
			],
			"description": "Red Orchestra 2 is a realistic, World War 2 shooter created by Tripwire Interactive. I worked with a small development team of other programmers and artists to specifically create the \"Search and Destroy\" mode. \"Search and-Destroy\" is an objective-based game mode where an attacking team of players has to plant a timed bomb onto an objective while the defending team is required to guard that objective.",
			"responsibilities":
			[
				"Worked in a multinational team of 10 other programmers, designers and artists to create a new, multiplayer game mode",
				"Developed all core gameplay systems including victory conditions and artificial intelligence",
				"Responsible for integrating network synchronization and replication",
				"Developed visual scripting tools for level designers to use within the Unreal Engine editor"
			]
		},
		"Events_Plus":
		{
			"name": "Events Plus",
			"platform": "Unity Plugin",
			"image": "images/EP.jpg",
			"mobileImage": "images/EP_M.jpg",
			"wideImage": "images/EP_W.jpg",
			"buttonImage": "images/EP_B.jpg",
			"tools":
			[
				"Unity3D",
				"C#",
				"HTML5",
				"JS",
				"CSS3"
			],
			"links":
			[
				{
					"name": "Website",
					"url": "http://www.eventsplusplugin.com/",
					"icon": "images/website.svg"
				},
				{
					"name": "Asset Store",
					"url": "https://assetstore.unity.com/packages/tools/utilities/events-plus-88827",
					"icon": "images/store.svg"
				}
			],
			"video": "https://www.youtube.com/embed/yZjW0vAGO78",
			"description": "Events Plus is a commercial Unity Plugin that gives developers the power to quickly prototype gameplay and wire up events without the need for code. It incorporates automatic linking and serialization of C# delegates within the Unity3D interface. As the sole developer, I am responsible for programming, support and marketing aspects of the plugin.",
			"responsibilities":
			[
				"Sole developer on a for-sale plugin for the Unity 3D Engine, with help from one graphic artist for marketing graphics",
				"Programmed a high-performance, dynamic delegate system that could serialize all class members directly through the editor",
				"Created online code API documentation, user manual, tutorial videos, and a product website",
				"Provided technical support directly to end-users"
			]
		},
		"Node_Graph_Editor":
		{
			"name": "Node Graph Editor",
			"platform": "Web Application",
			"image": "images/Graph.jpg",
			"mobileImage": "images/Graph_M.jpg",
			"wideImage": "images/Graph_W.jpg",
			"buttonImage": "images/Graph_B.jpg",
			"backgroundPosition": "center top",
			"tools":
			[
				"React",
				"Javascript ES6",
				"HTML5",
				"CSS3",
				"MobX",
				"CSS Modules",
				"d3"
			],
			"links":
			[
				{
					"name": "Live Demo",
					"url": "http://www.chassebrook.com/graphviz/",
					"icon": "images/website.svg"
				},
				{
					"name": "Github",
					"url": "https://github.com/chasse20/React-NodeGraphEditor",
					"icon": "images/website.svg"
				}
			],
			"video": "https://www.youtube.com/embed/nnaz6QJy8C4",
			"images":
			[
				{
					"thumbnail": "images/Graph_1_s.jpg",
					"url": "images/Graph_1.jpg"
				},
				{
					"thumbnail": "images/Graph_2_s.jpg",
					"url": "images/Graph_2.jpg"
				},
				{
					"thumbnail": "images/Graph_3_s.jpg",
					"url": "images/Graph_3.jpg"
				}
			],
			"description": "The Node Graph Editor is a cross-browser, web-based tool built in ReactJS. It was originally designed as a foundation for visual scripting, taking inspiration from other tools such as Twine and Unreal Engine's Blueprint. It has since been adapted for visualizing and analyzing node graph data for the United States Army Operational Environment Big Data Project (OE-BDP). Editing features include basic navigation, importing/exporting data, configuring node and edge types, creating nodes and linking nodes.",
			"responsibilities":
			[
				"Sole developer responsible for developing frontend and data modeling within the React framework",
				"Developed a fully-functional node graph editor inspired by popular game visual scripting tools",
				"Integrated industry leading packages such as d3, MobX and CSS Modules",
				"Created JSDOC documentation for all models and serialization formats"
			]
		},
		"ODIN":
		{
			"name": "ODIN",
			"platform": "Military Web Application",
			"image": "images/ODIN.jpg",
			"mobileImage": "images/ODIN_M.jpg",
			"wideImage": "images/ODIN_W.jpg",
			"buttonImage": "images/ODIN_B.jpg",
			"backgroundPosition": "center top",
			"tools":
			[
				"Angular",
				"PHP",
				"SQL",
				"HTML5",
				"JS",
				"CSS3"
			],
			"links":
			[
				{
					"name": "Website",
					"url": "http://odin.tradoc.army.mil/",
					"icon": "images/website.svg"
				}
			],
			"video": "https://www.youtube.com/embed/3-olyNchb8I",
			"images":
			[
				{
					"thumbnail": "images/ODIN_1_s.jpg",
					"url": "images/ODIN_1.jpg"
				},
				{
					"thumbnail": "images/ODIN_2_s.jpg",
					"url": "images/ODIN_2.jpg"
				},
				{
					"thumbnail": "images/ODIN_3_s.jpg",
					"url": "images/ODIN_3.jpg"
				}
			],
			"description": "The Operational Environment Data Integration Network (ODIN) is a training resource designed for the United States Army Training and Doctrine Command (TRADOC). The goal of the project was to digitize all existing Worldwide Equipment Guide (WEG), Decisive Action Training Environment (DATE 3.0), Force Structures (FS) and Training Publication (TC) data into one, online authoritative resource. It includes both a user-friendly frontend, a visual editor for content management, and machine-readable API endpoints for use in simulations. It has been highly acclaimed by TRADOC and is the flagship for future training digitization efforts.",
			"responsibilities":
			[
				"Lead full-stack developer on a diverse team of developers and user interface designers on a large-scale MVC application",
				"Designed and programmed Angular front-end for both the main product and admin editor",
				"Created a customized plugin for the MediaWiki CMS for customer administration with customized user roles and version approval",
				"Developed ElasticSearch integration for handling custom data models and advanced search features",
				"Core developer for all custom RESTful API's for handling machine-readable data used by multiple types of simulations",
				"Worked directly with the customer to iterate user interface and functionality for both the front-end and admin sections"
			]
		},
		"Hunt":
		{
			"name": "Hunt",
			"platform": "PC Game Jam",
			"image": "images/Hunt.jpg",
			"mobileImage": "images/Hunt_M.jpg",
			"wideImage": "images/Hunt_W.jpg",
			"buttonImage": "images/Hunt_B.jpg",
			"tools":
			[
				"Unity3D",
				"C#"
			],
			"links":
			[
				{
					"name": "Play",
					"url": "http://www.chassebrook.com/Jams/GGJ2016/",
					"icon": "images/play.svg"
				},
				{
					"name": "Game Jam Entry",
					"url": "https://globalgamejam.org/2016/games/hunt",
					"icon": "images/website.svg"
				}
			],
			"video": "https://www.youtube.com/embed/ns3nXUKb_y8",
			"images":
			[
				{
					"thumbnail": "images/Hunt_1_s.jpg",
					"url": "images/Hunt_1.jpg"
				},
				{
					"thumbnail": "images/Hunt_2_s.jpg",
					"url": "images/Hunt_2.jpg"
				},
				{
					"thumbnail": "images/Hunt_3_s.jpg",
					"url": "images/Hunt_3.jpg"
				}
			],
			"description": "Hunt is a short, narrative-driven game created for the 2016 Global Game Jam (theme: ritual). The player assumes the role of Nanook, a young hunter, performing his rite of passage in pursuit of a winter fox. Nanook must navigate through the wintry woods and successfully throw his spear to complete the spiritual hunt.",
			"responsibilities":
			[
				"Sole programmer on a small team consisting of artists and a sound designer",
				"Programmed basic character movement, dynamic weather effects, victory conditions, animation and audio feedback",
				"Integrated animation trees of the 3D character rigs into the game",
				"Co-designed gameplay, story and interactions of the game"
			]
		}
	}
}